tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/codec/port/fsl_codec_adapter.c
/*
 * Copyright  2019-2023 NXP
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_codec_adapter.h"
#include "fsl_codec_common.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*******************************************************************************
 * Variables
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/
/*!
 * brief Codec initilization.
 *
 * param handle codec handle.
 * param config codec configuration.
 * return kStatus_Success is success, else initial failed.
 */
status_t HAL_CODEC_Init(void *handle, void *config)
{
    assert((config != NULL) && (handle != NULL));

    codec_config_t *codecConfig = (codec_config_t *)config;
    status_t retVal             = kStatus_Success;

    switch (codecConfig->codecDevType)
    {
#ifdef CODEC_WM8904_ENABLE
        case kCODEC_WM8904:
            retVal = HAL_CODEC_WM8904_Init(handle, config);
            break;
#endif

#ifdef CODEC_WM8960_ENABLE
        case kCODEC_WM8960:
            retVal = HAL_CODEC_WM8960_Init(handle, config);
            break;
#endif

#ifdef CODEC_WM8962_ENABLE
        case kCODEC_WM8962:
            retVal = HAL_CODEC_WM8962_Init(handle, config);
            break;
#endif

#ifdef CODEC_WM8524_ENABLE
        case kCODEC_WM8524:
            retVal = HAL_CODEC_WM8524_Init(handle, config);
            break;
#endif

#ifdef CODEC_SGTL5000_ENABLE
        case kCODEC_SGTL5000:
            retVal = HAL_CODEC_SGTL5000_Init(handle, config);
            break;
#endif

#ifdef CODEC_DA7212_ENABLE
        case kCODEC_DA7212:
            retVal = HAL_CODEC_DA7212_Init(handle, config);
            break;
#endif

#ifdef CODEC_CS42888_ENABLE
        case kCODEC_CS42888:
            retVal = HAL_CODEC_CS42888_Init(handle, config);
            break;
#endif

#ifdef CODEC_CS42448_ENABLE
        case kCODEC_CS42448:
            retVal = HAL_CODEC_CS42448_Init(handle, config);
            break;
#endif

#ifdef CODEC_AK4497_ENABLE
        case kCODEC_AK4497:
            retVal = HAL_CODEC_AK4497_Init(handle, config);
            break;
#endif

#ifdef CODEC_AK4458_ENABLE
        case kCODEC_AK4458:
            retVal = HAL_CODEC_AK4458_Init(handle, config);
            break;
#endif

#ifdef CODEC_TFA9XXX_ENABLE
        case kCODEC_TFA9XXX:
            retVal = HAL_CODEC_TFA9XXX_Init(handle, config);
            break;
#endif

#ifdef CODEC_TFA9896_ENABLE
        case kCODEC_TFA9896:
            retVal = HAL_CODEC_TFA9896_Init(handle, config);
            break;
#endif

#ifdef CODEC_PCM512X_ENABLE
        case kCODEC_PCM512X:
            retVal = HAL_CODEC_PCM512x_Init(handle, config);
            break;
#endif

#ifdef CODEC_PCM186X_ENABLE
        case kCODEC_PCM186X:
            retVal = HAL_CODEC_PCM186x_Init(handle, config);
            break;
#endif

        default:
            retVal = kStatus_InvalidArgument;
            break;
    }

    return retVal;
}

/*!
 * brief Codec de-initilization.
 *
 * param handle codec handle.
 * return kStatus_Success is success, else de-initial failed.
 */
status_t HAL_CODEC_Deinit(void *handle)
{
    assert(handle != NULL);
    status_t retVal = kStatus_Success;

    switch (((codec_handle_t *)handle)->codecConfig->codecDevType)
    {
#ifdef CODEC_WM8904_ENABLE
        case kCODEC_WM8904:
            retVal = HAL_CODEC_WM8904_Deinit(handle);
            break;
#endif

#ifdef CODEC_WM8960_ENABLE
        case kCODEC_WM8960:
            retVal = HAL_CODEC_WM8960_Deinit(handle);
            break;
#endif

#ifdef CODEC_WM8962_ENABLE
        case kCODEC_WM8962:
            retVal = HAL_CODEC_WM8962_Deinit(handle);
            break;
#endif

#ifdef CODEC_WM8524_ENABLE
        case kCODEC_WM8524:
            retVal = HAL_CODEC_WM8524_Deinit(handle);
            break;
#endif

#ifdef CODEC_SGTL5000_ENABLE
        case kCODEC_SGTL5000:
            retVal = HAL_CODEC_SGTL5000_Deinit(handle);
            break;
#endif

#ifdef CODEC_DA7212_ENABLE
        case kCODEC_DA7212:
            retVal = HAL_CODEC_DA7212_Deinit(handle);
            break;
#endif

#ifdef CODEC_CS42888_ENABLE
        case kCODEC_CS42888:
            retVal = HAL_CODEC_CS42888_Deinit(handle);
            break;
#endif

#ifdef CODEC_CS42448_ENABLE
        case kCODEC_CS42448:
            retVal = HAL_CODEC_CS42448_Deinit(handle);
            break;
#endif

#ifdef CODEC_AK4497_ENABLE
        case kCODEC_AK4497:
            retVal = HAL_CODEC_AK4497_Deinit(handle);
            break;
#endif

#ifdef CODEC_AK4458_ENABLE
        case kCODEC_AK4458:
            retVal = HAL_CODEC_AK4458_Deinit(handle);
            break;
#endif

#ifdef CODEC_TFA9XXX_ENABLE
        case kCODEC_TFA9XXX:
            retVal = HAL_CODEC_TFA9XXX_Deinit(handle);
            break;
#endif

#ifdef CODEC_PCM512X_ENABLE
        case kCODEC_PCM512X:
            retVal = HAL_CODEC_PCM512x_Deinit(handle);
            break;
#endif

#ifdef CODEC_PCM186X_ENABLE
        case kCODEC_PCM186X:
            retVal = HAL_CODEC_PCM186x_Deinit(handle);
            break;
#endif

        default:
            retVal = kStatus_InvalidArgument;
            break;
    }

    return retVal;
}

/*!
 * brief set audio data format.
 *
 * param handle codec handle.
 * param mclk master clock frequency in HZ.
 * param sampleRate sample rate in HZ.
 * param bitWidth bit width.
 * return kStatus_Success is success, else configure failed.
 */
status_t HAL_CODEC_SetFormat(void *handle, uint32_t mclk, uint32_t sampleRate, uint32_t bitWidth)
{
    assert(handle != NULL);
    status_t retVal = kStatus_Success;

