tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/codec/port/fsl_codec_adapter.c
    switch (((codec_handle_t *)handle)->codecConfig->codecDevType)
    {
#ifdef CODEC_WM8904_ENABLE
        case kCODEC_WM8904:
            retVal = HAL_CODEC_WM8904_SetFormat(handle, mclk, sampleRate, bitWidth);
            break;
#endif

#ifdef CODEC_WM8960_ENABLE
        case kCODEC_WM8960:
            retVal = HAL_CODEC_WM8960_SetFormat(handle, mclk, sampleRate, bitWidth);
            break;
#endif

#ifdef CODEC_WM8962_ENABLE
        case kCODEC_WM8962:
            retVal = HAL_CODEC_WM8962_SetFormat(handle, mclk, sampleRate, bitWidth);
            break;
#endif

#ifdef CODEC_WM8524_ENABLE
        case kCODEC_WM8524:
            retVal = HAL_CODEC_WM8524_SetFormat(handle, mclk, sampleRate, bitWidth);
            break;
#endif

#ifdef CODEC_SGTL5000_ENABLE
        case kCODEC_SGTL5000:
            retVal = HAL_CODEC_SGTL5000_SetFormat(handle, mclk, sampleRate, bitWidth);
            break;
#endif

#ifdef CODEC_DA7212_ENABLE
        case kCODEC_DA7212:
            retVal = HAL_CODEC_DA7212_SetFormat(handle, mclk, sampleRate, bitWidth);
            break;
#endif

#ifdef CODEC_CS42888_ENABLE
        case kCODEC_CS42888:
            retVal = HAL_CODEC_CS42888_SetFormat(handle, mclk, sampleRate, bitWidth);
            break;
#endif

#ifdef CODEC_CS42448_ENABLE
        case kCODEC_CS42448:
            retVal = HAL_CODEC_CS42448_SetFormat(handle, mclk, sampleRate, bitWidth);
            break;
#endif

#ifdef CODEC_AK4497_ENABLE
        case kCODEC_AK4497:
            retVal = HAL_CODEC_AK4497_SetFormat(handle, mclk, sampleRate, bitWidth);
            break;
#endif

#ifdef CODEC_AK4458_ENABLE
        case kCODEC_AK4458:
            retVal = HAL_CODEC_AK4458_SetFormat(handle, mclk, sampleRate, bitWidth);
            break;
#endif

#ifdef CODEC_TFA9XXX_ENABLE
        case kCODEC_TFA9XXX:
            retVal = HAL_CODEC_TFA9XXX_SetFormat(handle, mclk, sampleRate, bitWidth);
            break;
#endif

#ifdef CODEC_PCM512X_ENABLE
        case kCODEC_PCM512X:
            retVal = HAL_CODEC_PCM512x_SetFormat(handle, mclk, sampleRate, bitWidth);
            break;
#endif

#ifdef CODEC_PCM186X_ENABLE
        case kCODEC_PCM186X:
            retVal = HAL_CODEC_PCM186x_SetFormat(handle, mclk, sampleRate, bitWidth);
            break;
#endif

        default:
            retVal = kStatus_InvalidArgument;
            break;
    }

    return retVal;
}

/*!
 * brief set audio codec module volume.
 *
 * param handle codec handle.
 * param channel audio codec play channel, can be a value or combine value of _codec_play_channel.
 * param volume volume value, support 0 ~ 100, 0 is mute, 100 is the maximum volume value.
 * return kStatus_Success is success, else configure failed.
 */
status_t HAL_CODEC_SetVolume(void *handle, uint32_t playChannel, uint32_t volume)
{
    assert(handle != NULL);
    status_t retVal = kStatus_Success;

    switch (((codec_handle_t *)handle)->codecConfig->codecDevType)
    {
#ifdef CODEC_WM8904_ENABLE
        case kCODEC_WM8904:
            retVal = HAL_CODEC_WM8904_SetVolume(handle, playChannel, volume);
            break;
#endif

#ifdef CODEC_WM8960_ENABLE
        case kCODEC_WM8960:
            retVal = HAL_CODEC_WM8960_SetVolume(handle, playChannel, volume);
            break;
#endif

#ifdef CODEC_WM8962_ENABLE
        case kCODEC_WM8962:
            retVal = HAL_CODEC_WM8962_SetVolume(handle, playChannel, volume);
            break;
#endif

#ifdef CODEC_WM8524_ENABLE
        case kCODEC_WM8524:
            retVal = HAL_CODEC_WM8524_SetVolume(handle, playChannel, volume);
            break;
#endif

#ifdef CODEC_SGTL5000_ENABLE
        case kCODEC_SGTL5000:
            retVal = HAL_CODEC_SGTL5000_SetVolume(handle, playChannel, volume);
            break;
#endif

#ifdef CODEC_DA7212_ENABLE
        case kCODEC_DA7212:
            retVal = HAL_CODEC_DA7212_SetVolume(handle, playChannel, volume);
            break;
#endif

#ifdef CODEC_CS42888_ENABLE
        case kCODEC_CS42888:
            retVal = HAL_CODEC_CS42888_SetVolume(handle, playChannel, volume);
            break;
#endif

#ifdef CODEC_CS42448_ENABLE
        case kCODEC_CS42448:
            retVal = HAL_CODEC_CS42448_SetVolume(handle, playChannel, volume);
            break;
#endif

#ifdef CODEC_AK4497_ENABLE
        case kCODEC_AK4497:
            retVal = HAL_CODEC_AK4497_SetVolume(handle, playChannel, volume);
            break;
#endif

#ifdef CODEC_AK4458_ENABLE
        case kCODEC_AK4458:
            retVal = HAL_CODEC_AK4458_SetVolume(handle, playChannel, volume);
            break;
#endif

#ifdef CODEC_TFA9XXX_ENABLE
        case kCODEC_TFA9XXX:
            retVal = HAL_CODEC_TFA9XXX_SetVolume(handle, playChannel, volume);
            break;
#endif

#ifdef CODEC_PCM512X_ENABLE
        case kCODEC_PCM512X:
            retVal = HAL_CODEC_PCM512x_SetVolume(handle, playChannel, volume);
            break;
#endif

#ifdef CODEC_PCM186X_ENABLE
        case kCODEC_PCM186X:
            retVal = HAL_CODEC_PCM186x_SetVolume(handle, playChannel, volume);
            break;
#endif

        default:
            retVal = kStatus_InvalidArgument;
            break;
    }

    return retVal;
}

/*!
 * brief set audio codec module mute.
 *
 * param handle codec handle.
 * param channel audio codec play channel, can be a value or combine value of _codec_play_channel.
 * param isMute true is mute, false is unmute.
 * return kStatus_Success is success, else configure failed.
 */
status_t HAL_CODEC_SetMute(void *handle, uint32_t playChannel, bool isMute)
{
    assert(handle != NULL);
    status_t retVal = kStatus_Success;

    switch (((codec_handle_t *)handle)->codecConfig->codecDevType)
    {
#ifdef CODEC_WM8904_ENABLE
        case kCODEC_WM8904:
            retVal = HAL_CODEC_WM8904_SetMute(handle, playChannel, isMute);
            break;
#endif

#ifdef CODEC_WM8960_ENABLE
        case kCODEC_WM8960:
            retVal = HAL_CODEC_WM8960_SetMute(handle, playChannel, isMute);
            break;
#endif

#ifdef CODEC_WM8962_ENABLE
        case kCODEC_WM8962:
            retVal = HAL_CODEC_WM8962_SetMute(handle, playChannel, isMute);
            break;
#endif

#ifdef CODEC_WM8524_ENABLE
        case kCODEC_WM8524:
            retVal = HAL_CODEC_WM8524_SetMute(handle, playChannel, isMute);
            break;
#endif

#ifdef CODEC_SGTL5000_ENABLE
        case kCODEC_SGTL5000:
            retVal = HAL_CODEC_SGTL5000_SetMute(handle, playChannel, isMute);
            break;
#endif

#ifdef CODEC_DA7212_ENABLE
        case kCODEC_DA7212:
            retVal = HAL_CODEC_DA7212_SetMute(handle, playChannel, isMute);
            break;
#endif

