tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/codec/port/fsl_codec_adapter.c
#ifdef CODEC_CS42888_ENABLE
        case kCODEC_CS42888:
            retVal = HAL_CODEC_CS42888_SetMute(handle, playChannel, isMute);
            break;
#endif

#ifdef CODEC_CS42448_ENABLE
        case kCODEC_CS42448:
            retVal = HAL_CODEC_CS42448_SetMute(handle, playChannel, isMute);
            break;
#endif

#ifdef CODEC_AK4497_ENABLE
        case kCODEC_AK4497:
            retVal = HAL_CODEC_AK4497_SetMute(handle, playChannel, isMute);
            break;
#endif

#ifdef CODEC_AK4458_ENABLE
        case kCODEC_AK4458:
            retVal = HAL_CODEC_AK4458_SetMute(handle, playChannel, isMute);
            break;
#endif

#ifdef CODEC_TFA9XXX_ENABLE
        case kCODEC_TFA9XXX:
            retVal = HAL_CODEC_TFA9XXX_SetMute(handle, playChannel, isMute);
            break;
#endif

#ifdef CODEC_PCM512X_ENABLE
        case kCODEC_PCM512X:
            retVal = HAL_CODEC_PCM512x_SetMute(handle, playChannel, isMute);
            break;
#endif

#ifdef CODEC_PCM186X_ENABLE
        case kCODEC_PCM186X:
            retVal = HAL_CODEC_PCM186x_SetMute(handle, playChannel, isMute);
            break;
#endif

        default:
            retVal = kStatus_InvalidArgument;
            break;
    }

    return retVal;
}

/*!
 * brief set audio codec module power.
 *
 * param handle codec handle.
 * param module audio codec module.
 * param powerOn true is power on, false is power down.
 * return kStatus_Success is success, else configure failed.
 */
status_t HAL_CODEC_SetPower(void *handle, uint32_t module, bool powerOn)
{
    assert(handle != NULL);
    status_t retVal = kStatus_Success;

    switch (((codec_handle_t *)handle)->codecConfig->codecDevType)
    {
#ifdef CODEC_WM8904_ENABLE
        case kCODEC_WM8904:
            retVal = HAL_CODEC_WM8904_SetPower(handle, module, powerOn);
            break;
#endif

#ifdef CODEC_WM8960_ENABLE
        case kCODEC_WM8960:
            retVal = HAL_CODEC_WM8960_SetPower(handle, module, powerOn);
            break;
#endif

#ifdef CODEC_WM8962_ENABLE
        case kCODEC_WM8962:
            retVal = HAL_CODEC_WM8962_SetPower(handle, module, powerOn);
            break;
#endif

#ifdef CODEC_WM8524_ENABLE
        case kCODEC_WM8524:
            retVal = HAL_CODEC_WM8524_SetPower(handle, module, powerOn);
            break;
#endif

#ifdef CODEC_SGTL5000_ENABLE
        case kCODEC_SGTL5000:
            retVal = HAL_CODEC_SGTL5000_SetPower(handle, module, powerOn);
            break;
#endif

#ifdef CODEC_DA7212_ENABLE
        case kCODEC_DA7212:
            retVal = HAL_CODEC_DA7212_SetPower(handle, module, powerOn);
            break;
#endif

#ifdef CODEC_CS42888_ENABLE
        case kCODEC_CS42888:
            retVal = HAL_CODEC_CS42888_SetPower(handle, module, powerOn);
            break;
#endif

#ifdef CODEC_CS42448_ENABLE
        case kCODEC_CS42448:
            retVal = HAL_CODEC_CS42448_SetPower(handle, module, powerOn);
            break;
#endif

#ifdef CODEC_AK4497_ENABLE
        case kCODEC_AK4497:
            retVal = HAL_CODEC_AK4497_SetPower(handle, module, powerOn);
            break;
#endif

#ifdef CODEC_AK4458_ENABLE
        case kCODEC_AK4458:
            retVal = HAL_CODEC_AK4458_SetPower(handle, module, powerOn);
            break;
#endif

#ifdef CODEC_TFA9XXX_ENABLE
        case kCODEC_TFA9XXX:
            retVal = HAL_CODEC_TFA9XXX_SetPower(handle, module, powerOn);
            break;
#endif

#ifdef CODEC_PCM512X_ENABLE
        case kCODEC_PCM512X:
            retVal = HAL_CODEC_PCM512x_SetPower(handle, module, powerOn);
            break;
#endif

#ifdef CODEC_PCM186X_ENABLE
        case kCODEC_PCM186X:
            retVal = HAL_CODEC_PCM186x_SetPower(handle, module, powerOn);
            break;
#endif

        default:
            retVal = kStatus_InvalidArgument;
            break;
    }

    return retVal;
}

/*!
 * brief codec set record source.
 *
 * param handle codec handle.
 * param source audio codec record source, can be a value or combine value of _codec_record_source.
 *
 * return kStatus_Success is success, else configure failed.
 */
status_t HAL_CODEC_SetRecord(void *handle, uint32_t recordSource)
{
    assert(handle != NULL);
    status_t retVal = kStatus_Success;

    switch (((codec_handle_t *)handle)->codecConfig->codecDevType)
    {
#ifdef CODEC_WM8904_ENABLE
        case kCODEC_WM8904:
            retVal = HAL_CODEC_WM8904_SetRecord(handle, recordSource);
            break;
#endif

#ifdef CODEC_WM8960_ENABLE
        case kCODEC_WM8960:
            retVal = HAL_CODEC_WM8960_SetRecord(handle, recordSource);
            break;
#endif

#ifdef CODEC_WM8962_ENABLE
        case kCODEC_WM8962:
            retVal = HAL_CODEC_WM8962_SetRecord(handle, recordSource);
            break;
#endif

#ifdef CODEC_WM8524_ENABLE
        case kCODEC_WM8524:
            retVal = HAL_CODEC_WM8524_SetRecord(handle, recordSource);
            break;
#endif

#ifdef CODEC_SGTL5000_ENABLE
        case kCODEC_SGTL5000:
            retVal = HAL_CODEC_SGTL5000_SetRecord(handle, recordSource);
            break;
#endif

#ifdef CODEC_DA7212_ENABLE
        case kCODEC_DA7212:
            retVal = HAL_CODEC_DA7212_SetRecord(handle, recordSource);
            break;
#endif

#ifdef CODEC_CS42888_ENABLE
        case kCODEC_CS42888:
            retVal = HAL_CODEC_CS42888_SetRecord(handle, recordSource);
            break;
#endif

#ifdef CODEC_CS42448_ENABLE
        case kCODEC_CS42448:
            retVal = HAL_CODEC_CS42448_SetRecord(handle, recordSource);
            break;
#endif

#ifdef CODEC_AK4497_ENABLE
        case kCODEC_AK4497:
            retVal = HAL_CODEC_AK4497_SetRecord(handle, recordSource);
            break;
#endif

#ifdef CODEC_AK4458_ENABLE
        case kCODEC_AK4458:
            retVal = HAL_CODEC_AK4458_SetRecord(handle, recordSource);
            break;
#endif

#ifdef CODEC_TFA9XXX_ENABLE
        case kCODEC_TFA9XXX:
            retVal = HAL_CODEC_TFA9XXX_SetRecord(handle, recordSource);
            break;
#endif

