tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/codec/port/fsl_codec_adapter.c
#ifdef CODEC_PCM512X_ENABLE
        case kCODEC_PCM512X:
            retVal = HAL_CODEC_PCM512x_SetRecord(handle, recordSource);
            break;
#endif

#ifdef CODEC_PCM186X_ENABLE
        case kCODEC_PCM186X:
            retVal = HAL_CODEC_PCM186x_SetRecord(handle, recordSource);
            break;
#endif

        default:
            retVal = kStatus_InvalidArgument;
            break;
    }

    return retVal;
}

/*!
 * brief codec set record channel.
 *
 * param handle codec handle.
 * param leftRecordChannel audio codec record channel, reference _codec_record_channel, can be a value or combine value
 of member in _codec_record_channel.
 * param rightRecordChannel audio codec record channel, reference _codec_record_channel, can be a value combine of
 member in _codec_record_channel.

 * return kStatus_Success is success, else configure failed.
 */
status_t HAL_CODEC_SetRecordChannel(void *handle, uint32_t leftRecordChannel, uint32_t rightRecordChannel)
{
    assert(handle != NULL);
    status_t retVal = kStatus_Success;

    switch (((codec_handle_t *)handle)->codecConfig->codecDevType)
    {
#ifdef CODEC_WM8904_ENABLE
        case kCODEC_WM8904:
            retVal = HAL_CODEC_WM8904_SetRecordChannel(handle, leftRecordChannel, rightRecordChannel);
            break;
#endif

#ifdef CODEC_WM8960_ENABLE
        case kCODEC_WM8960:
            retVal = HAL_CODEC_WM8960_SetRecordChannel(handle, leftRecordChannel, rightRecordChannel);
            break;
#endif

#ifdef CODEC_WM8962_ENABLE
        case kCODEC_WM8962:
            retVal = HAL_CODEC_WM8962_SetRecordChannel(handle, leftRecordChannel, rightRecordChannel);
            break;
#endif

#ifdef CODEC_WM8524_ENABLE
        case kCODEC_WM8524:
            retVal = HAL_CODEC_WM8524_SetRecordChannel(handle, leftRecordChannel, rightRecordChannel);
            break;
#endif

#ifdef CODEC_SGTL5000_ENABLE
        case kCODEC_SGTL5000:
            retVal = HAL_CODEC_SGTL5000_SetRecordChannel(handle, leftRecordChannel, rightRecordChannel);
            break;
#endif

#ifdef CODEC_DA7212_ENABLE
        case kCODEC_DA7212:
            retVal = HAL_CODEC_DA7212_SetRecordChannel(handle, leftRecordChannel, rightRecordChannel);
            break;
#endif

#ifdef CODEC_CS42888_ENABLE
        case kCODEC_CS42888:
            retVal = HAL_CODEC_CS42888_SetRecordChannel(handle, leftRecordChannel, rightRecordChannel);
            break;
#endif

#ifdef CODEC_CS42448_ENABLE
        case kCODEC_CS42448:
            retVal = HAL_CODEC_CS42448_SetRecordChannel(handle, leftRecordChannel, rightRecordChannel);
            break;
#endif

#ifdef CODEC_AK4497_ENABLE
        case kCODEC_AK4497:
            retVal = HAL_CODEC_AK4497_SetRecordChannel(handle, leftRecordChannel, rightRecordChannel);
            break;
#endif

#ifdef CODEC_AK4458_ENABLE
        case kCODEC_AK4458:
            retVal = HAL_CODEC_AK4458_SetRecordChannel(handle, leftRecordChannel, rightRecordChannel);
            break;
#endif

#ifdef CODEC_TFA9XXX_ENABLE
        case kCODEC_TFA9XXX:
            retVal = HAL_CODEC_TFA9XXX_SetRecordChannel(handle, leftRecordChannel, rightRecordChannel);
            break;
#endif

#ifdef CODEC_PCM512X_ENABLE
        case kCODEC_PCM512X:
            retVal = HAL_CODEC_PCM512x_SetRecordChannel(handle, leftRecordChannel, rightRecordChannel);
            break;
#endif

#ifdef CODEC_PCM186X_ENABLE
        case kCODEC_PCM186X:
            retVal = HAL_CODEC_PCM186x_SetRecordChannel(handle, leftRecordChannel, rightRecordChannel);
            break;
#endif

        default:
            retVal = kStatus_InvalidArgument;
            break;
    }

    return retVal;
}

/*!
 * brief codec set play source.
 *
 * param handle codec handle.
 * param playSource audio codec play source, can be a value or combine value of _codec_play_source.
 *
 * return kStatus_Success is success, else configure failed.
 */
status_t HAL_CODEC_SetPlay(void *handle, uint32_t playSource)
{
    assert(handle != NULL);
    status_t retVal = kStatus_Success;

    switch (((codec_handle_t *)handle)->codecConfig->codecDevType)
    {
#ifdef CODEC_WM8904_ENABLE
        case kCODEC_WM8904:
            retVal = HAL_CODEC_WM8904_SetPlay(handle, playSource);
            break;
#endif

#ifdef CODEC_WM8960_ENABLE
        case kCODEC_WM8960:
            retVal = HAL_CODEC_WM8960_SetPlay(handle, playSource);
            break;
#endif

#ifdef CODEC_WM8962_ENABLE
        case kCODEC_WM8962:
            retVal = HAL_CODEC_WM8962_SetPlay(handle, playSource);
            break;
#endif

#ifdef CODEC_WM8524_ENABLE
        case kCODEC_WM8524:
            retVal = HAL_CODEC_WM8524_SetPlay(handle, playSource);
            break;
#endif

#ifdef CODEC_SGTL5000_ENABLE
        case kCODEC_SGTL5000:
            retVal = HAL_CODEC_SGTL5000_SetPlay(handle, playSource);
            break;
#endif

#ifdef CODEC_DA7212_ENABLE
        case kCODEC_DA7212:
            retVal = HAL_CODEC_DA7212_SetPlay(handle, playSource);
            break;
#endif

#ifdef CODEC_CS42888_ENABLE
        case kCODEC_CS42888:
            retVal = HAL_CODEC_CS42888_SetPlay(handle, playSource);
            break;
#endif

#ifdef CODEC_CS42448_ENABLE
        case kCODEC_CS42448:
            retVal = HAL_CODEC_CS42448_SetPlay(handle, playSource);
            break;
#endif

#ifdef CODEC_AK4497_ENABLE
        case kCODEC_AK4497:
            retVal = HAL_CODEC_AK4497_SetPlay(handle, playSource);
            break;
#endif

#ifdef CODEC_AK4458_ENABLE
        case kCODEC_AK4458:
            retVal = HAL_CODEC_AK4458_SetPlay(handle, playSource);
            break;
#endif

#ifdef CODEC_TFA9XXX_ENABLE
        case kCODEC_TFA9XXX:
            retVal = HAL_CODEC_TFA9XXX_SetPlay(handle, playSource);
            break;
#endif

#ifdef CODEC_PCM512X_ENABLE
        case kCODEC_PCM512X:
            retVal = HAL_CODEC_PCM512x_SetPlay(handle, playSource);
            break;
#endif

